app/controllers/embassies_controller.rb

SELECT "embassies".* FROM "embassies"
---
  def index
    @embassies = Embassy.all