app/controllers/users_controller.rb

INSERT INTO "users" ("username", "email", "password_digest", "role", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save

UPDATE "users" SET "username" = ?, "password_digest" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["username", "expat team"], ["password_digest", "$2a$12$TRXAuJGnNTovqycrsABEOOUh3xMVmqU233R4GaF/zUu9Fi9T8qEx2"], ["updated_at", "2020-11-17 17:45:28.479997"], ["id", 3]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)